[
  {
    "id": 1,
    "name": "Citizen TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/1_icon_citizentv-profile.png",
    "description": "Citizen TV Kenya is a general news and entertainment television channel headquartered in Nairobi. It offers news bulletins, movies, TV series, music programs, talk shows, and other programs. Watch Citizen TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "190,474 views"
  },
  {
    "id": 2,
    "name": "KTN Home Live",
    "icon": "https://kenyalivetv.co.ke/channels/2_icon_ktnhome.jpg",
    "description": "KTN Home is a Kenyan free-to-air television network that was launched in March 1990 by Jared Kangwana. Watch KTN Home Live online on kenyalivetv.co.ke\n\nKTN Home Live stream for the latest news, politics, entertainment, and sport. Watch Kenya's first independent and authoritative channel 24/7. \n\nIt is headquartered at Standard Group Centre, Nairobi. It was the first free-to-air privately owned television network in Africa, and the first to break KBC's monopoly in Kenya.\n\nKTN Home (KTN Kenya Classics) Channel will bring you the most popular programs that were aired on KTN. Be sure to be entertained every day on this channel. The Home of Classics and Great Comedies of all time.",
    "status": "Offline",
    "views": "99,608 views"
  },
  {
    "id": 3,
    "name": "Ramogi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/3_icon_ramogitv-profile.jpg",
    "description": "Ramogi TV is a 24-hour free-to-air channel offering general entertainment to customers and broadcasts in Dholuo language.\n\nThe channels programming line-up includes news, talk shows, commentaries, current, social, real life issues, news and educational content. Watch Ramogi TV online on kenyalivetv.co.ke on mobile. \n\nRamogi TV is widely available on ADN, Signet, Citizen Digital app, Viusasa and YouTube.Ramogi TV is a 24 hour television station tailored for the Luo speaking audience as the primary target.",
    "status": "Offline",
    "views": "213,802 views"
  },
  {
    "id": 4,
    "name": "Inooro TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/4_icon_inoorotv.jpg",
    "description": "Inooro TV Kenya is a Kikuyu television station based in Kiambu, Kiambu County. It offers latest news, music programs, TV series, talk shows, and other entertainment programs. Watch Inooro TV Live online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "42,496 views"
  },
  {
    "id": 5,
    "name": "NTV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/5_icon_ntv-profile.jpg",
    "description": "NTV Kenya is a commercial telelvision station owned and operated by Nation Media Group. It broadcasts news programs (politics, business, sports, showbiz, TV drama series, music programs, documentaries, talk shows, and more. The headquarters is located in Nairobi, Kenya. Watch NTV Kenya online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "40,308 views"
  },
  {
    "id": 6,
    "name": "KBC Channel 1 Live",
    "icon": "https://kenyalivetv.co.ke/channels/6_icon_kbctv.jpg",
    "description": "KBC Channel 1 is a free-to-air television channel owned by Kenya Broadcasting Corporation (KBC TV), the state-run broadcasting organization of Kenya. The headquarters is located in Nairobi. \n\nIt offers a wide range of programs, such as news bulletins, dramas, music shows, sitcoms, reality shows, animated shows, children's programs and more. Watch KBC TV Live online on kenyalivetv.co.ke for free\n\nKenya Broadcasting Corporation (KBC) is the state-run media organisation of Kenya. It broadcasts in English and Swahili, as well as in most local languages of Kenya. The corporation started its life in 1928 when Kenya was a British colony. It was the first station in Kenya.",
    "status": "Offline",
    "views": "69,191 views"
  },
  {
    "id": 7,
    "name": "K24 TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/7_icon_k24tv-profile.jpg",
    "description": "K24 TV is a 24 hour television station, broadcasting in English and Swahili languages. It broadcasts national & international news, business & financial news, TV dramas, movies, variety shows, sporting events such as EPL Maskani Live on K24 TV & sports-related programs, animated series, music shows, and more. Watch K24 TV online on kenyalivetv.co.ke on any device.",
    "status": "Offline",
    "views": "20,741 views"
  },
  {
    "id": 8,
    "name": "KTN News Live",
    "icon": "https://kenyalivetv.co.ke/channels/8_icon_ktn-news-profile.jpg",
    "description": "KTN News Kenya is a 24-hour news and current affairs channel broadcasting in English and Swahili languages. It is run by the Kenya Television Network (KTN), which is a subsidiary of Kenyan multimedia company Standard Group. The headquarters is located in Nairobi. Watch KTN News online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "19,388 views"
  },
  {
    "id": 9,
    "name": "Lolwe TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/9_icon_download.png",
    "description": "Lolwe TV is number one Luo digital TV station currently available free to air signal under PANG LOLWE TV also on Startimes channels 179 and 525 and Zuku on channel 35.",
    "status": "Offline",
    "views": "13,055 views"
  },
  {
    "id": 10,
    "name": "TV47 Live",
    "icon": "https://kenyalivetv.co.ke/channels/10_icon_images (2).jpeg",
    "description": "TV47 Kenya is a television station headquartered in Nairobi. It broadcasts up-to-date news, talk shows, discussion programs, interview shows, music programs, sports-related programs, entertainment shows and children's programs in English and Swahili languages. Watch TV47 online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "18,587 views"
  },
  {
    "id": 11,
    "name": "Elimu TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/11_icon_elimu-tv.jpg",
    "description": "Elimu TV Kenya is an educational tv channel providing primary & Secondary School Education and other educational Programs.\n\nElimu Tv is a 24hrs Tv station dedicated to Educational video content. We have over 600 hrs of high school videos which can be accessed from our online portal or by watching our Free to Air Digital TV channel on Pang, Signet and Satellite.\nwww.elimutv.co.ke\n\nStudy online on Elimu Digital online learning via whatsApp \nregister form 1, 2, 3 or 4 or class 7 & 8 today\nSECONDARY SUBJECTS: mathematics,english,kiswahili,chemistry,physics,biology,history,geography,CRE,business,Agriculture \nPRIMARY SUBJECTS: mathematics, English, Kiswahili, science, social studies, CRE. ",
    "status": "Online",
    "views": "4,076 views"
  },
  {
    "id": 12,
    "name": "Kameme TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/12_icon_kameme-profile.png",
    "description": "Kameme TV is a Kikuyu-language television station that broadcasts news and entertainment programs. The channel is owned by Mediamax Network Limited, located in Nairobi. Watch Kameme TV  online on kenyalivetv.co.ke ",
    "status": "Offline",
    "views": "17,242 views"
  },
  {
    "id": 13,
    "name": "Y254 TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/13_icon_download.jpeg",
    "description": "Y254 TV Kenya is a youth-oriented television channel that broadcasts music videos, chat shows and other entertainment programs. It is owned and operated by Kenya Broadcasting Corporation (KBC TV), the state-run broadcasting organization of Kenya.",
    "status": "Online",
    "views": "20,625 views"
  },
  {
    "id": 14,
    "name": "Ebru TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/14_icon_ebru-profile.jpg",
    "description": "Ebru TV Kenya is an English-language satellite television channel focused on news, current affairs, lifestyle, and entertainment. It is headquartered in Nairobi, Kenya. Watch Ebru TV online on kenyalivetv.co.ke\n\nFind Ebru TV Kenya on Dstv channel 268, Zuku channel 17, Gotv channel 96, Signet, Bamba Tv and Startimes channel 109",
    "status": "Offline",
    "views": "9,218 views"
  },
  {
    "id": 15,
    "name": "Romanza TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/15_icon_romanzatv-profile.jpg",
    "description": "Romanza+ Africa is a premium Telenovela television channel compiled especially for Africa. Get your dose of love, betrayal and passion with new episodes everyday. Whether you are looking for a traditional love story or a romance filled with betrayal, action and drama Romanza+ Africa has it all for you.",
    "status": "Offline",
    "views": "36,297 views"
  },
  {
    "id": 16,
    "name": "Akili Kids TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/16_icon_akili-profile.png",
    "description": "Akili Kids TV is the first and only dedicated free-to-air children's television network with imaginative and educative content that parents can trust and children will benefit from.\n\nAkili Kids! - aspiring to be the most trusted Kenyan brand in children and family entertainment.\n\nBrought to you by Akili Network Ltd.",
    "status": "Offline",
    "views": "9,669 views"
  },
  {
    "id": 17,
    "name": "UTV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/17_icon_utv-profile.jpg",
    "description": "UTV Kenya is a FREE TO AIR Channel with a cumulative audience of more than 4,100,000. We are currently available countrywide via Signet channel 516 (Signet- UTV) TV 45,PANG 79, all free to air decoders,and online www.utv.ke Motivated by the quest to advance in\ndevelopment of digital television network and the introduction of advanced digital electronic. UTV Television has intensified efforts to enable more and more Kenyans access quality television broadcasting.\n\nThe Television has extended It’s coverage to over 70 per cent of the Kenya’s population and is expected to rise to over 80 percent by the end of year 2020. Currently, UTV has funs across 41 Counties in Kenya, thanks to signal distributors. The demographic consists both youths and old generation who consume commercials, news, art and music (gospel, classic, country) and sports. Watch UTV Kenya Live online on kenyalivetv.co.ke\n\nThe station runs a series of local TV programs such as SINEMA KIKWETU, KIJIJINI, MTUMISHI, Youth Movies (developed by the youth) in our youth talent development segment, Shamba Tosha (a framers training segment), Hadithi zetu, Action movies, Nigerian Movies and many more.",
    "status": "Offline",
    "views": "14,448 views"
  },
  {
    "id": 18,
    "name": "HLC TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/18_icon_download (1).jpeg",
    "description": "HLC TV is a Company that cherishes professionalism, Integrity, Honesty and providing quality and affordable services to its clients. The Company is geared towards meeting the demands of changing peoples lives economy, coming up with innovative products that transforms lives. #HLCTVLIVE",
    "status": "Offline",
    "views": "6,819 views"
  },
  {
    "id": 19,
    "name": "Mukeu TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/19_icon_1662764917227.jpg",
    "description": "Mukeu TV is a Platform build up in a view to share information. \n#mukeutv",
    "status": "Online",
    "views": "3,856 views"
  },
  {
    "id": 20,
    "name": "Jambu TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/20_icon_jambutv.jpg",
    "description": "Discover a world of endless entertainment with Jambu TV. From the latest movies and TV shows, to live sports and music, we've got you covered. Enjoy the convenience of watching your favorite content anytime, anywhere, with our user-friendly platform. Stay ahead of the curve and immerse yourself in a world of endless entertainment with Jambu TV Kenya.",
    "status": "Online",
    "views": "15,598 views"
  },
  {
    "id": 21,
    "name": "Lookup TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/21_icon_download.png",
    "description": "Lookup TV is a free-to-air television channel based in Nairobi, Nairobi County. It broadcasts news bulletins, current affairs programs, TV dramas, entertainment shows, talk shows, religious programs, and others. Watch Lookup TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "4,457 views"
  },
  {
    "id": 22,
    "name": "Kass TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/22_icon_download (2).jpeg",
    "description": "Kass TV Kenya is a commercial television channel owned and operated by Kass Media Group, headquartered in Nairobi. The channel offers latest news, sporting events, music programs, variety shows, documentaries, kids shows, and agritech information programs, broadcasting in English and Swahili languages. Live streaming and various on-demand videos can be watched online.",
    "status": "Offline",
    "views": "4,681 views"
  },
  {
    "id": 23,
    "name": "Capuchin TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/23_icon_1662765604301.jpg",
    "description": "Capuchin TV will aim to provide our viewers with positive, uplifting shows geared towards faith formation and information, and suitable for all age and church groups. These include programs for children (PMC), the Youth, Choirs, CWA, CMA, couples, the aged among others. In addition we aim to have shows for human interest, dealing with socio-economic activities of the people.\n\nAn idea that begun from a casual talk over a cup of tea was followed by a deed-seated desire to bring it to reality. Capuchin TV, the first Catholic television in Kenya seeks to supplement and add value to the existing efforts of evangelization and the integral human development.\n\nPeace and Goodness! Welcome to capuchin Television Network, Your Catholic Identity and the First Catholic Broadcasting Ministry in Kenya. \n\n\nThank you and God bless you for supporting this Catholic Broadcasting Ministry on Mpesa PAYBILL NO. 510678, Account name capstv.\n\nWe are available on Startimes(PANG) cHANNEL 470, and in all free to air Decorders. \n\nContact us on:\nSMS 21760\nCall 0717424866/ 0781497770\nWhatsApp 0724347305\nFacebook; Capuchin Television Network\nTwitter; @Capuchin Tv\nEmail; info@capuchintv.co.ke,\nWebsite, www.capuchintv.co.ke",
    "status": "Offline",
    "views": "6,002 views"
  },
  {
    "id": 24,
    "name": "3 Stones TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/24_icon_3-stones-tv-profile.jpg",
    "description": "3 Stones TV is Kenya’s first Kikuyu-language digital television channel launched in November 2012. The Channel broadcasts a full line-up of locally-produced quality programming that informs on our collective history and on our vast cultural knowledge,  as well as  programs on contemporary subjects. These range from lifestyle and financial to educational and self-improvement content.",
    "status": "Offline",
    "views": "9,490 views"
  },
  {
    "id": 25,
    "name": "Venus TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/25_icon_download.png",
    "description": "Venus TV Kenya is a 24-hour broadcasting station available on Signet. We air creative, informative, entertaining and innovative shows that aims to set higher standards.\n\nVenus TV is the newest channel in Kenya, we are dedicated to entertain our viewers with their favourites music, block buster movies and latest sports updates.",
    "status": "Online",
    "views": "3,218 views"
  },
  {
    "id": 26,
    "name": "Meru TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/26_icon_download (3).jpeg",
    "description": "Meru TV Kenya's No.1 premier MERU/ISIOLO/EMBU/CHUKA/ TV station.For Breaking News,social News and Entertainment.",
    "status": "Offline",
    "views": "3,569 views"
  },
  {
    "id": 27,
    "name": "Horizon TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/27_icon_images.jpeg",
    "description": "Horizon TV is a Islamic tv station in Kenya. Beacon For The Nation",
    "status": "Offline",
    "views": "4,478 views"
  },
  {
    "id": 28,
    "name": "Voice Of Victory TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/28_icon_voicetv-profile.jpg",
    "description": "Voice Of Victory TV ( VVTV ) is a Bible Word Based Church, that Believes in the Strong Healing Power of Jesus Christ under the Stewardship of the Man of God Prophet Bernard Ojay. God uses Him Powerfully In the Prophetic Healing and Deliverance, where Millions of Lives have been changed by the Glory of our Lord Jesus Christ.",
    "status": "Offline",
    "views": "3,053 views"
  },
  {
    "id": 29,
    "name": "Switch TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/29_icon_switchtv-icon.jpg",
    "description": "Switch TV Kenya , Watch full episodes of current and new Switch TV shows online. Plus find previews, promos & Live TV on switchtv.ke. watch switch tv online on kenyalivetv.co.ke\n\nSwitch TV is a young, energetic, & dynamic channel that serves Africa's youth. About Our Company. Simple, Positive, Inspirational. Switch Media Ltd.",
    "status": "Online",
    "views": "6,502 views"
  },
  {
    "id": 30,
    "name": "Hope TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/30_icon_hopetv-profile.png",
    "description": "Hope TV Kenya Hope Media is a ministry of Christ Is The Answer Ministries (CITAM). It comprises of two broadcasting stations, radio – Hope FM and TV – Hope TV. These stations are complimented with the creative design division Hope Creative and Recording Studios – Hope Studios.\n\nTherefore providing a converged media environment. Hope Media stations are run on clear Christian principles as avenues for outreach, nourishment and holistic ministry for varied audiences with the Gospel message of Jesus Christ Hope Media through radio and TV endeavors to deliver well-balanced content in form of up-to-date information, entertainment and education broadcasting around the clock.\n\nPrograms on Hope FM and Hope TV are designed to Inspire, Educate and Challenge (ICE) listeners and viewers with wholesome content in diverse demographic groups; children, youth and adults both male and female in our selected target markets.\n\nOur current product offering includes sermons, praise and worship gospel music, inspirational talks, commentaries, sports, news and advertising services Hope Media broadcasts are hosted on Terrestrial, Satellite, Online and Mobile platforms accessible anywhere around the globe.",
    "status": "Offline",
    "views": "3,912 views"
  },
  {
    "id": 31,
    "name": "Mutongoi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/31_icon_mutongoi.jpeg",
    "description": "Mutongoi TV is a Kamba television station in the lower eastern region of kenya, including Machakos, Nairobi, Kitui, Makueni, Kajiado, and Mombasa counties. Its programming consists of news and infotainment shows, movies, music shows, youth-oriented entertainment shows, TV dramas, talk shows, and more. The headquarters is located in Machakos, Machakos County.\nLive streaming and on-demand videos can be viewed via its official websites.\n\nMutongoi TV and Mutongoi FM are the fastest growing and leading Kikamba Stations serving Machakos, Kitui, Makueni, Mombasa, Nairobi & Kajiado. Kibwezi 100.2FM ,Kitui 103.3FM and VOI 102.9FM.",
    "status": "Offline",
    "views": "6,421 views"
  },
  {
    "id": 32,
    "name": "Muugi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/32_icon_download.png",
    "description": "MUUGI TV, MUGAMBO WA KWIHOKEKA",
    "status": "Offline",
    "views": "3,741 views"
  },
  {
    "id": 33,
    "name": "Spirit TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/33_icon_spirittv.jpg",
    "description": "Spirit TV Kenya is aiming in promoting the youth.",
    "status": "Online",
    "views": "2,483 views"
  },
  {
    "id": 34,
    "name": "Tumaini TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/34_icon_tumainitv.jpg",
    "description": "Tumaini TV is a Christian TV Station bringing Hope to the Nations.\nFounded by Bishop Dr. Charles Marita & Reverend. Dr Elizabeth Marita.",
    "status": "Offline",
    "views": "2,049 views"
  },
  {
    "id": 35,
    "name": "GBS TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/35_icon_download (6).jpeg",
    "description": "Goodnews Broadcasting System (GBS TV) is a Christian-based television station headquartered in Nairobi. It broadcasts sermons, talk shows, discussion shows, health and wellness programs, children-focused educational programs, cartoons, documentaries, and more. Live stream is available via its official website.",
    "status": "Offline",
    "views": "2,317 views"
  },
  {
    "id": 36,
    "name": "Raia TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/36_icon_raiatv.jpg",
    "description": "Raia TV is a free-to-air television channel that broadcasts entertainment and cultural programs in Swahili language. Its programming includes music shows, talk shows, interview shows, TV dramas, movies, news updates, and more.The headquarters is located in Mombasa, Mombasa County.",
    "status": "Offline",
    "views": "4,962 views"
  },
  {
    "id": 37,
    "name": "Njata TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/37_icon_njata-tv.png",
    "description": "Njata TV Kenya is a free-to-air Kikuyu-language television channel based in Nairobi, Kenya. It broadcasts news programs, talk shows, music programs, documentaries, and more. Watch Njata TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "4,354 views"
  },
  {
    "id": 38,
    "name": "Heaven Bound TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/38_icon_heavenboundtv.jpg",
    "description": "Heaven Bound TV is a Christian Broadcasting & Media Production Company based in Kiambu, Kenya. Available on free to air digital tv platform.",
    "status": "Offline",
    "views": "1,598 views"
  },
  {
    "id": 39,
    "name": "Yahweh's TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/39_icon_yahwehtvlogo.jpg",
    "description": "Yahweh's TV Kenya is a Television Channel with sole aim of Propagating the Gospel of Christ and Promoting Christian Ethics and Talents within the Sphere of Africa.",
    "status": "Online",
    "views": "2,753 views"
  },
  {
    "id": 40,
    "name": "Younib TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/40_icon_download (6).jpeg",
    "description": "Younib TV is Catholic but interfaith youth oriented Television. Ever the Best!\n\nWatch us on free to air  signet channel 22.\nFrequency 482 (Manual Search)\nTo advertise with us contact 0719144144 or send us an email\n\nWatch us on GOLIVEAFRICA & watch us on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "2,614 views"
  },
  {
    "id": 41,
    "name": "Mop TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/41_icon_moptv.jpg",
    "description": "MOP TV Kenya is a Christian based Tv station located in Umoja 3 area Nairobi county. you can reach us via mobile number +254 727 873 214, email shalommedia04@gmail.com.",
    "status": "Online",
    "views": "1,932 views"
  },
  {
    "id": 42,
    "name": "EBN TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/42_icon_ebntv.png",
    "description": "EBN TV Kenya offers diverse programming that includes Christian and commercial content that conveys Christian and family values in a contemporary way.\n\nEBN TV is a dynamic commercial tv station that seeks to deliver informative, educational, and entertaining programs 24 .\n\nConnect with us:\nFacebook: @EBN TV\nTwitter: @ebntvkenya\nInstagram: @ebntvkenya\nYouTube: EBN TV Kenya\nWebsite: http://www.ebntv.co.ke",
    "status": "Online",
    "views": "1,984 views"
  },
  {
    "id": 43,
    "name": "Nice TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/43_icon_download (7).jpeg",
    "description": "NICE TV Kenya , is the fastest growing Kikuyu Television. Watch our daily..",
    "status": "Offline",
    "views": "2,234 views"
  },
  {
    "id": 44,
    "name": "New Life TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/44_icon_download (8).jpeg",
    "description": "New Life TV Founded by Evangelist Ezekiel,Newlife Prayer Centre & Church.\nActs: 5:20 “Go, stand in the temple and speak to the people qall the words of this life.\n\nIt's a Ministry which deals with solving both spititual\nand physical problems.As you watch these Faith \nbuilding Preaching , Miracles,Deliverances,\nTestimonies and Prophecies, we encourage you to\nplease SUBSCRIBE to uor youtube Channel.God bless you\n\nPrayer Line/M-Pesa: +254 723596503/ +254 703333363/ +254 700873451\n\nEvery week, New life prayer center hosts thousands of national and international visitors. People travel from around the world to witness and receive from the mighty work that God is doing in the life of Pastor Ezekiel. We welcome visitors from across the globe to stay with us and witness first-hand proof that Jesus Christ is the same yesterday, today and forever!",
    "status": "Offline",
    "views": "14,239 views"
  },
  {
    "id": 45,
    "name": "Thstone TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/45_icon_download (2).png",
    "description": "ThStone Tv be is a commercial Tv that brings you Entertainment, Religious programs,Sports,politics .\n\nThstone TV is a television network based in Kenya. It provides entertainment and educational programming to audiences in Kenya and beyond. \n\nThe network offers a mix of local and international content, including news, sports, music, movies, dramas, and more. Thstone TV is dedicated to providing high-quality programming that informs, educates, and inspires its viewers, and has a strong commitment to the cultural and social development of the communities it serves.",
    "status": "Offline",
    "views": "1,831 views"
  },
  {
    "id": 46,
    "name": "Family TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/46_icon_images.jpeg",
    "description": "Family TV Kenya is a Christian television station owned and operated by Family Media, an independent Christian media company based in Nairobi, Nairobi County. It broadcasts not only sermons but also health-themed programs, music programs, talk shows and other programs.\n",
    "status": "Offline",
    "views": "2,441 views"
  },
  {
    "id": 47,
    "name": "HCK TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/47_icon_download (1).jpeg",
    "description": "HCK TV Kenya ( Hope Channel Kenya) is a premier television station that is owned and operated by the Seventh-day Adventist Church in Kenya (East and West Kenya Union Conferences).\nLocated at East Kenya Union Conference Headquarters, in Nairobi, Hope Channel Kenya (HCK) has been in operation since November 2013.\n\nHCK started to broadcast in Nairobi and its environs but in January 2015 went countrywide and so far covers parts of neighbouring countries such as Tanzania, Uganda, and South Sudan.\n\nHCK produces and broadcasts programs every day of the week for 24 hours. So far we\nproduce and broadcast 50% local content and supplement with programs from our international channel (Hope Channel).\n\nWe boast of a viewership of about five million people half of which are Seventh-day Adventists. Our strongholds include Nairobi, Mombasa, Malindi, Eldoret, Nakuru, Kericho, Kisumu, Kitale, Marigat, Oljororok, Nyahururu, Nyeri, Embu, Meru, Machakos, Kitui, Mt Elgon, Migori, Kendu-Bay, Kisii, Kilgoris, Narok, and Kakamega, Garrissa, Mandera, among others; and parts of neighboring countries including Busia in Uganda, the Eastern parts of Arusha and Mwanza in Tanzania.\n\nThis is evidenced by the number of phone calls and text messages we receive from these areas for the various programs that we broadcast",
    "status": "Offline",
    "views": "7,403 views"
  },
  {
    "id": 48,
    "name": "KTN Farmers TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/48_icon_farmerstv-profile.jpg",
    "description": "KTN Farmers TV, a 24-hour agribusiness TV station, Maisha Kilimo, a weekly agriculture show on Radio Maisha, and www.farmers.co.ke, an integrated website that creates and aggregates agri-content, hosts a Digital Marketplace, and wide range of Agri-Data. Other platforms include specialized events such as Farm Connect and the Annual Farmers Mkulima Expo, and dedicated Social Media platforms.\nKTN Farmers TV ,The FarmKenya Initiative is The Standard Group PLC",
    "status": "Offline",
    "views": "3,164 views"
  },
  {
    "id": 49,
    "name": "CM TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/49_icon_cmtv-profile.jpg",
    "description": "CM TV (Corporate Media Television) is a regional commercial broadcasting station(free to air) based in Eldoret,Kenya the home of champions",
    "status": "Offline",
    "views": "1,489 views"
  },
  {
    "id": 50,
    "name": "Sayare TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/50_icon_images.jpeg",
    "description": "Sayare TV , ( Sauti ya Rehema )is a Christian Radio and television network founded in 1998. It is widely known for its trade name ‘SAYARE’. We aim at giving our listeners a well balanced programming, informing, teaching and entertaining, yet safe to listen by every member of the family.\n\nVision\nTo reach out with the Gospel of Jesus Christ.\n\nMission\nUsing the major electronic communication tools to Evangelize,   Educate and Transform Man in his Totality – Mind, Soul and Spirit.",
    "status": "Offline",
    "views": "2,050 views"
  },
  {
    "id": 51,
    "name": "MTN Kenya TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/51_icon_download (1).png",
    "description": "MTN Kenya TV is both a Christian and secular based digital television channel broadcasting in English, Swahili and vernacular languages.\n\nThe 24-hour-channel is dedicated to serve all the Christians in the country and any other person who is interested in our broadcasting which is blended with development programmes.\n\nThis is the official MTV Fan page Your Number Favourite TV channel entertaining family with touch..for the latest movies,comedy,cartoons & all our programs.\n\nThe channel is specifically designed to cater for the day to day needs of the Christians of all ages and other viewers with a unique experience in broadcasting.\n\nAs an organization, we are therefore committed to providing the highest level of interactive programming which is anchored on three pillars; informative, educative and entertaining.",
    "status": "Online",
    "views": "2,405 views"
  },
  {
    "id": 52,
    "name": "Nuru TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/52_icon_nurutv.jpg",
    "description": "Nuru TV Kenya is a commercial based Television channel broadcasting in both English and Kiswahili Language, we intent to deliver high standards of  infotainment and become an independent mega film production house across the country.",
    "status": "Offline",
    "views": "3,463 views"
  },
  {
    "id": 53,
    "name": "Uvoro TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/53_icon_uvorotv-profile.jpg",
    "description": "Uvoro TV is a local channel broadcasting in Kiembu. We take pride in the provision of a trusted and indispensable source of information, music, and entertainment while strengthening the civic and cultural life of the larger Mt. Kenya region.",
    "status": "Online",
    "views": "1,338 views"
  },
  {
    "id": 54,
    "name": "Daesak TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/54_icon_daesaktv-profile.jpg",
    "description": "Daesak TV is a digital news platform under “THE DAESAK MEDIA SERVICES LTD”. We are passionate about community services and developments.\n\nDaesak TV is a TV station licensed by the Communication Authority of Kenya as a commercial free-to-air television station.\n\nOur vision is to have a society that upholds empathy, mentorship and progressive leadership for the wellbeing of all.\n\nOur mission is to champion for empathy, celebrate progressive leadership and promote mentorship through our media outlets. Our objectives are\n•To be the voice of the community.\n•To restore hope in society.\n•To create opportunities.\n•To awaken potential & improve live hoods.\n•To be part of the transformative agenda through educative programming and sound entertainment.",
    "status": "Online",
    "views": "1,129 views"
  },
  {
    "id": 55,
    "name": "Enchipai TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/55_icon_enchipaitv.jpg",
    "description": "Enchipai TV is the first maasai tv channel in Kenya available on set-top boxes .It broadcasts in maa languages. Enchipai TV channel connect all the maa community by bringing them together when watching same local tv channel.\n\n\n\nPremier Maasai Television Promoting the Maasai culture locally and globally in a fun and responsible way.Discover kenya and News from global front first with enchipai digital.\n\nLearn the Maasai culture as narrated by the locals, experience Africa's diverse content. Get to know what's happening in Kenya and Abroad in local maasai language.\n\nConnect with us:\nFacebook: @Enchipai TV\nTwitter: @enchipaitv\nInstagram: @enchipaitv\nYouTube: Enchipai TV\nWebsite: http://www.enchipaitv.com",
    "status": "Online",
    "views": "1,059 views"
  },
  {
    "id": 56,
    "name": "Kingdom TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/56_icon_kingdom tv.png",
    "description": "Kingdom TV is a Christian television station offering Christian precepts and teachings and faith-based music programs. It is based in Nairobi, Nairobi County.",
    "status": "Offline",
    "views": "1,437 views"
  },
  {
    "id": 57,
    "name": "Elevate TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/57_icon_images.png",
    "description": "Elevate TV  is a Kenyan based television based in Nairobi Kenya. We broadcasts in locally produced and imported content in English and Kiswahili languages. As Elevate TV Channel we  provide  television media outreach to minister and build lives in the kingdom of God, in the nation of Kenya and beyond. \n\nWe are inspired by our achievements in deploying programs in the following channels: LIGHT OF LIFE BROADCAST for 10 years through GBS TV, Truth FM, Kingdom TV and MBCI TV.  Our bedrock organization, Life church International and her related ministries, have been a strong pillar committing funds for the gospel outreach where millions of lives have been reached and ministered to through the Television and Radio ministry. We feel obliged to meet the needs of our viewership listeners that are of diverse religious, social and economic backgrounds in Kenya and the region.",
    "status": "Offline",
    "views": "1,550 views"
  },
  {
    "id": 58,
    "name": "Breaking The Limits TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/58_icon_download (1).jpeg",
    "description": "Breaking the Limits TV is a dynamic television channel based in Kenya that provides a platform for airing a wide range of programming. From news and current affairs to entertainment and lifestyle, Breaking the Limits TV delivers quality content that is both informative and engaging. ",
    "status": "Offline",
    "views": "1,708 views"
  },
  {
    "id": 59,
    "name": "Elisam TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/59_icon_elisamtv.jpeg",
    "description": "Elisam TV channel is all about, Developing stories, Documentaries, Sports, Entertainment, and spiritual nourishment.And many more. Be inspired by the stories of others. Search our channel for stories, documentaries, sports, and entertainment. You'll also find spiritual nourishment and a lot of other great content.",
    "status": "Online",
    "views": "1,996 views"
  },
  {
    "id": 60,
    "name": "In Christ TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/60_icon_inchristtv.jpg",
    "description": "ICTV - In Christ Television is a faith-based television network founded for the purpose of bringing sanity and understanding of true Christianity.\n\nFAITH EMBASSY MEDIA believes no one can work alone. So ICTV (In Christ Television) exist to help, and stand with men and women who  are in ministry or even business, but are not known due to the un-affordable nature of the television industry, or advertising agencies. We have created the most economical avenue in broadcasting. ICTV provides  a voice to be heard for everyone, we believe YOU NEED TO BE HEARD. ",
    "status": "Offline",
    "views": "1,438 views"
  },
  {
    "id": 61,
    "name": "Mutembei TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/61_icon_mutembeitv.jpg",
    "description": "Mutembei TV services airs political events, corporate events, wedding ceremony, ruracio, Birthday parties, company's anniversaries, Demos, Exhibition and Exposition and any other event,call on 0738044033 or email magicalkenyantv@gmail.com and book your date with Mutembei TV. Live Maandamano on Mutembei TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "18,704 views"
  },
  {
    "id": 62,
    "name": "Kirk TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/62_icon_download (1).jpeg",
    "description": "KIRK TV Kenya is a faith-based television station established to enrich the viewers holistically by\naddressing personal, family, faith, health & environment.\n\nKirk TV Kenya aim is to maintain constant contact with viewers using a multiple platform approach that goes beyond TV and take full advantage of digital, on the ground and one on one activation to ensure that it consistently remains top of mind for audiences.",
    "status": "Online",
    "views": "2,569 views"
  },
  {
    "id": 63,
    "name": "Gikuyu TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/63_icon_download.jpeg",
    "description": "Gikuyu TV is a leading vernacular station that brings you Kikuyu entertainment, news, shows, movies, and so much more like DJ Afro.\n\nThe station headquarters is in Allsops Oilibya petrol station 2nd floor next to Naivas. Some of the most popular programmes aired on gikuyu tv channel include:\n\nGikuyu Rucini\nGukengakenga\nIria Ria Kiroho\nThuguri\nMohoro\nHaha kwa Haha\nNdeto Kiuburo\nKuariria Ngoro\nMohoro ma Gikuyu Miaraho\n",
    "status": "Online",
    "views": "6,389 views"
  },
  {
    "id": 64,
    "name": "Mzalendo TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/64_icon_mzalendo-icon.jpg",
    "description": "Mzalendo TV is an Entertainment channel in English, Swahili and the Kikuyu dialect. Business | Fashion & Lifestyle | Health | Agriculture | DJ Afro movies. mzalendotv.co.ke",
    "status": "Online",
    "views": "25,374 views"
  },
  {
    "id": 65,
    "name": "Nissi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/65_icon_unnamed.png",
    "description": "Nissi TV Kenya is a christian TV station airing on Kenyan Local cable network. Find us on signet platform @SIGNET NISSI.",
    "status": "Online",
    "views": "1,580 views"
  },
  {
    "id": 66,
    "name": "GPGTV Live",
    "icon": "https://kenyalivetv.co.ke/channels/66_icon_gpgtvke.jpg",
    "description": "GPGTV Kenya, we purpose to reach all mankind with the Gospel of the Love of Jesus Christ (Luke 4:43). We  Accept to be the vessels of Honor ready for use in reaching all communities in order to uplift, to edify and to encourage them through our programmes. \n\nOur core values are: Integrity, Excellence, Positivity, Consistency, Faithfulness and Passionate care. We value and respect all as Children of God.\n\nGo Preach Gospel TV presents to you an avenue where we share teachings of encouragement with you and strengthen your faith in God. Catch us on GPG TV , The House of Worship.\n\nOn Go TV : Channel 810    On Startimes : Channel 493     On Star: Channel 39\nWe are also available on the pang free to air channel selection and online on kenyalivetv.co.ke\n\nAlso Find us on Sefidi App. Simply \"get started\" and scroll down to GPG TV.",
    "status": "Online",
    "views": "1,018 views"
  },
  {
    "id": 67,
    "name": "MBCI TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/67_icon_mbcitv.jpg",
    "description": "MBCI TV has nationwide coverage and can be watched on all free-to-air decoders.MBCI TV and radio offers transformative and entertaining content that appeals to all age demographics.\n\nMBCI Media is highly rated in terms of professional presentation,\nprogramming, content, and clear signals. We prioritize development,\nknowledge empowerment to our audience, cohesion, human interest stories that influence positive behavior and positive change.\n\nWe offer unique entertainment that promotes local talent and radio theatre that brings together and unites people from different cultural backgrounds. Our primary target audience are both men and women of all ages living in both rural and urban areas.",
    "status": "Offline",
    "views": "4,826 views"
  },
  {
    "id": 68,
    "name": "Alltime TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/68_icon_alltimetv.jpg",
    "description": "Alltime TV Kenya is a Christian television network that focuses on broadcasting religious programming and content 24/7. It offers a variety of shows, including sermons, teachings, worship music, interviews with religious leaders, and other faith-based content. The aim of Alltime TV is to spread the message of Christianity and provide a source of inspiration and guidance to its viewers.",
    "status": "Online",
    "views": "1,564 views"
  },
  {
    "id": 69,
    "name": "Afrobeats TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/69_icon_download (2).jpeg",
    "description": "Afrobeats TV is a music television channel that showcases the best in African music, lifestyle and entertainment. It features popular Afrobeats music videos, live performances, and other entertaining content from African artists and celebrities. The channel provides an exciting platform to celebrate and promote the vibrant Afrobeats culture.",
    "status": "Offline",
    "views": "4,381 views"
  },
  {
    "id": 70,
    "name": "Signs TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/70_icon_signstv.jpg",
    "description": "Signs TV Kenya was formed in 2011 operating on a social enterprise model with the main objectives being to educate, inform and entertain in sign language by extension enhancing Disability and the Deaf Culture.\n\nIn 2015 we applied to the Communication Authority of Kenya to run a television station broadcasting in Sign Language and were granted; we are now broadcasting effective February 2017 on free to air platform as Signs TV and offer publicity in terms of advertisements, documentaries and general partnerships to organizations at very affordable rates.\n\nSigns TV has been broadcasting free content in sign language since 2017 with a central mission to build cultural bridges, remove barriers, eliminate stigma and create a society that allows free interaction between persons with disabilities (PWD) and non-PWDs.\n\nSigns TV is also playing a crucial role in the response to the global pandemic by collaborating with the government and partners to analyze the challenges faced by PWDs in light of COVID-19, while highlighting solutions, which include providing virtual interpreters in hospitals, universities and places of employment.",
    "status": "Online",
    "views": "1,752 views"
  },
  {
    "id": 71,
    "name": "Emmanuel TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/71_icon_images (4).jpeg",
    "description": "Emmanuel TV is a television station with one way and one job. The way is Jesus and the job is to talk about Him to others through words and deeds. Our motto is: Changing lives, changing nations and changing the world. God’s Word is the most effective instrument for change.\nThe people hear and change. Nations hear and change. The world hears and changes.\n\nEmmanuel TV is a television station with one way and one job. The way is Jesus and the job is to talk about Him to others through words and deeds. Our motto is: Changing lives, changing nations and changing the world. God’s Word is the most effective instrument for change. The people hear and change. Nations hear and change. The world hears and changes. Emmanuel means God is with us! (Matthew 1:23) Watch Emmanuel TV and witness the power of God in action. God keeps giving us plenty of evidence to believe in Him.",
    "status": "Offline",
    "views": "1,618 views"
  },
  {
    "id": 72,
    "name": "Soa TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/72_icon_soatv.jpg",
    "description": "Soa TV is ONE OF THE FASTEST GROWING CHRISTIAN TELEVISION STATIONS IN KENYA. ...Feel free to get in touch with us for any recommendations, suggestions, inquiries or comments via 0727 438 728 or 0705 899 608",
    "status": "Offline",
    "views": "1,073 views"
  },
  {
    "id": 73,
    "name": "PPP TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/73_icon_download (2).jpeg",
    "description": "Triple P TV (PPP TV) We are a 24HR entertainment channel for the hippest music lovers celebrating local talent. Catch up on celebrity lifestyles, freshest music videos and 70% Kenyan local talent on star times channel 100. We feature both secular and Gospel music.\n\nSMS PPP to 29055 to get latest updates on the entertainment industry.\n\nSMS 20455 to interact with your favorite celebrities and give comments or suggestions on our program line up. Also request for your choice of music and download your favorite gospel tunes.\n\nPPP TV is Music Tv channel on StarTimes Media Platform.70% of all the music in the channel is Kenyan while 30% represents International music sources.",
    "status": "Online",
    "views": "8,182 views"
  },
  {
    "id": 74,
    "name": "Star TV Tanzania Live",
    "icon": "https://kenyalivetv.co.ke/channels/74_icon_startv.jpg",
    "description": "Star TV Tanzania is a commercial television station that broadcasts news programs, sports games updates, music shows, TV drama series, talk shows, and other cultural and entertainment programs. The headquarters is located in Mwanza, Mwanza Region, and the branch office is situated in Dar es Salaam.",
    "status": "Offline",
    "views": "3,072 views"
  },
  {
    "id": 75,
    "name": "Ark TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/75_icon_arktvuganda.jpeg",
    "description": "Ark TV is a Christian television channel operated by Holy City Entebbe, a Christian organization based in Entebbe, Wakiso District. It offers sermons, teachings, gospel music shows, and more. The channel can also be viewed live via the Internet.",
    "status": "Offline",
    "views": "1,347 views"
  },
  {
    "id": 76,
    "name": "Mwangaza TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/76_icon_mwangazatv-profile.jpg",
    "description": "Mwangaza TV Kenya is a Christian free-to-air television network that was launched in march 2020 by Bishop Edward Mwai. It's headquarters are at Jewel Complex, Nairobi.",
    "status": "Offline",
    "views": "1,818 views"
  },
  {
    "id": 77,
    "name": "Plug TV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/77_icon_plugtv-profile.png",
    "description": "Plug TV Kenya is a fast growing digital TV in Kenya that provides a unique blend of informative and entertainment content across the digital space as a result we command millions of organic audiences across our social media pages, our mission is to tell great stories using the power of infotaining content across the digital world.",
    "status": "Online",
    "views": "1,018 views"
  },
  {
    "id": 78,
    "name": "Aljazeera TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/78_icon_channels4_profile.jpg",
    "description": "Al Jazeera TV is a state-owned Arabic-language international radio and TV broadcaster of Qatar. It is based in Doha and operated by the media conglomerate Al Jazeera Media Network. The flagship of the network, its station identification, is Al Jazeera.",
    "status": "Offline",
    "views": "3,846 views"
  },
  {
    "id": 79,
    "name": "France 24 Live",
    "icon": "https://kenyalivetv.co.ke/channels/79_icon_download (2).png",
    "description": "France 24 is a French state-owned international news television network based in Paris. Its channels broadcast in French, English, Arabic, and Spanish and are aimed at the overseas market. Based in the Paris suburb of Issy-les-Moulineaux, the service started on 6 December 2006. ",
    "status": "Offline",
    "views": "1,727 views"
  },
  {
    "id": 80,
    "name": "One Accord TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/80_icon_download (1).png",
    "description": "One Accord Tv station started in 2019 as an answer to bring whole some Christian content that will build its viewers both spiritually and intellectually, in an age where there are a lot of false doctrines that mislead those that have no alternative sources. One Accord came at a very opportune time where the world was forced to go digital in order to reach the various audiences with the measures that were brought by the pandemic from the year 2020.",
    "status": "Offline",
    "views": "1,402 views"
  },
  {
    "id": 81,
    "name": "Sky News TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/81_icon_images.png",
    "description": "Sky News is a British English language free-to-air television news channel and organisation. Sky News is distributed via a radio news service, and through online channels. It is owned by Sky Group, a division of Comcast. John Ryley is the head of Sky News, a role he has held since June 2006. ",
    "status": "Offline",
    "views": "2,219 views"
  },
  {
    "id": 82,
    "name": "NTV Uganda Live",
    "icon": "https://kenyalivetv.co.ke/channels/82_icon_images.jpeg",
    "description": "NTV Uganda TV went on air in December 2006. The Station airs across Uganda as a free-to-air Channel. NTV Uganda is a subsidiary of Nation Media Group.\n\nUganda's leading TV station, fast and first reliable, objective and comprehensive news, plus unrivaled quality programming.",
    "status": "Offline",
    "views": "34,849 views"
  },
  {
    "id": 83,
    "name": "World Evangelism TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/83_icon_images (1).jpeg",
    "description": "World Evangelism TV ( WETV ), is a christian tv station in Kenya .Thank You for Supporting Newlife Prayer Centre & Church.",
    "status": "Offline",
    "views": "3,012 views"
  },
  {
    "id": 84,
    "name": "Pillar TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/84_icon_pillartv.jpg",
    "description": "Pillar TV Vision is growing Church witnessing for Christ. Mission is to holistically equip God’s people using the Gospel of Christ\n\nThe Diocese of Kirinyaga is called to proclaim the Gospel of Christ, maintain the culture of worship and inspire all persons with the love of Christ so that they may live life in abundance.",
    "status": "Offline",
    "views": "1,306 views"
  },
  {
    "id": 85,
    "name": "TBC 1 Live",
    "icon": "https://kenyalivetv.co.ke/channels/85_icon_download (1).jpeg",
    "description": "Tanzania Broadcasting Corporation (TBC) is the national public television network of Tanzania. It operates two television channels, TBC1 and TBC2. The headquarters is located in Dar es Salaam.",
    "status": "Offline",
    "views": "2,001 views"
  },
  {
    "id": 86,
    "name": "TBC 2 Live",
    "icon": "https://kenyalivetv.co.ke/channels/86_icon_download (1).jpeg",
    "description": "Tanzania Broadcasting Corporation (TBC) is the national public television network of Tanzania. It operates two television channels, TBC1 and TBC2. The headquarters is located in Dar es Salaam.",
    "status": "Offline",
    "views": "1,564 views"
  },
  {
    "id": 87,
    "name": "Bukeede TV 1 Live",
    "icon": "https://kenyalivetv.co.ke/channels/87_icon_download.jpeg",
    "description": "Bukkede TV 1 is a Luganda-language television station headquartered in Kampala, Central Region. It offers latest news, sports updates, entertainment shows, music programs, and more. It is owned by Vision Group (officially: New Vision Printing & Publishing Company Limited / NVPPCL), a multimedia conglomerate in Uganda.\nBukkede TV operates two channels, Bukkede 1 and 2.",
    "status": "Offline",
    "views": "1,762 views"
  },
  {
    "id": 88,
    "name": "Bukeede TV 2 Live",
    "icon": "https://kenyalivetv.co.ke/channels/88_icon_download.png",
    "description": "Bukkede TV 2 is a Luganda-language television station headquartered in Kampala, Central Region. It offers latest news, sports updates, entertainment shows, music programs, and more. It is owned by Vision Group (officially: New Vision Printing & Publishing Company Limited / NVPPCL), a multimedia conglomerate in Uganda.\nBukkede TV operates two channels, Bukkede 1 and 2.",
    "status": "Offline",
    "views": "1,434 views"
  },
  {
    "id": 89,
    "name": "Edu Channel Live",
    "icon": "https://kenyalivetv.co.ke/channels/89_icon_images.png",
    "description": "EDU TV Kenya is owned and powered by the Kenya Institute of Curriculum Development (KICD) in its content delivery. This channel provides engaging KICD educational videos for holistic learning. It is amazing how the institute has factored in the needs of all learners, both in secondary and primary schools, to provide an educative platform at the comfort of their homes.\n\nKICD Educational Channel (EDU channel) is the first ever digital education channel in Kenya.It enhances equality and access to quality educational content to Kenya and beyond hence unify society in terms of knowledge,national goals and entertainment.The Channel is used to disseminate curriculum and curriculum support materials.",
    "status": "Online",
    "views": "2,833 views"
  },
  {
    "id": 90,
    "name": "Utana TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/90_icon_utanatv.jpg",
    "description": "Utana Tv is a Commercial Television station that is focused to Educate,Inform and Entertain it's viewers across all Age groups and Social Classes.",
    "status": "Online",
    "views": "1,060 views"
  },
  {
    "id": 91,
    "name": "KTN Burudani Live",
    "icon": "https://kenyalivetv.co.ke/channels/91_icon_logo3.png",
    "description": "KTN Burudani TV is number one website that delivers realtime news across the globe. The top headlines covers politics, citizen journalism, culture, business, sports and entertainment. Standard Digital - Your Gateway",
    "status": "Online",
    "views": "1,417 views"
  },
  {
    "id": 92,
    "name": "BBC News Live",
    "icon": "https://kenyalivetv.co.ke/channels/92_icon_channels4_profile.jpg",
    "description": "BBC News is an operational business division of the British Broadcasting Corporation responsible for the gathering and broadcasting of news and current affairs in the UK and around the world. ",
    "status": "Online",
    "views": "1,562 views"
  },
  {
    "id": 93,
    "name": "Channels Television Live",
    "icon": "https://kenyalivetv.co.ke/channels/93_icon_download (3).jpeg",
    "description": "Channels Television is a leading 24-hour news channel broadcasting live from Lagos, Nigeria - West Africa.  Our mission is to produce and broadcast television programs of quality and integrity that recognize and challenge, the intelligence and curiosity of our viewers. \n\nThe station has bagged the ‘Best Television station of the Year’ an award endowed by the Nigerian Media Merit Award Trust – fourteen times in the last twenty years (2000, 2001, 2003, 2004, 2008, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2018 and 2020).\n\nChannels team has produced feature programs, which have received commendation throughout the country; video footage of events and happenings in Nigeria, shot by Channels News crew have been used widely by reputable broadcast organisations such as BBC-TV, CNN, ITN and McNeil/Lehrer News Hour.\n\nDo not forget to subscribe to this channel for up-to-date news on politics, business, health, current affairs, entertainment, and sports in Nigeria.",
    "status": "Online",
    "views": "770 views"
  },
  {
    "id": 94,
    "name": "Nyota TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/94_icon_download.jpeg",
    "description": "Nyota Television is the premier Free to Air channel broadcasting the best and latest in news, sports and entertainment live to the comfort of your home , phone and even on radio via Nyota FM.",
    "status": "Online",
    "views": "2,604 views"
  },
  {
    "id": 95,
    "name": "Africa News Live",
    "icon": "https://kenyalivetv.co.ke/channels/95_icon_images.jpeg",
    "description": "Africanews on YouTube brings you a daily dose of news, produced by Africans for Africans. Africanews is the first pan-African multilingual media outlet, unique in its concept and vision.\n\nSubscribe on our Youtube channel and receive all the latest news from the continent. Africanews is available in English and French.",
    "status": "Offline",
    "views": "1,151 views"
  },
  {
    "id": 96,
    "name": "His Grace TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/96_icon_download.jpeg",
    "description": "His Grace is a Christian Media House offering the Christian faith platform for inspiration and spiritual nourishment.",
    "status": "Offline",
    "views": "1,287 views"
  },
  {
    "id": 97,
    "name": "Faith TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/97_icon_faithtv-profile.jpg",
    "description": "Welcome to Faith TV Kenya Channel : The Heart Of The Gospel\n\nSpreading Faith & Holiness to the world through Archbishop Dr. Harrison. K. Ng'ang'a.\n\nThe Heart Of The Gospel. Spreading the Faith to the world.\n\nWatch our channel locally through free to air decoders and decoder ready TVs : PANG Faith TV Kenya\n\n\nFollow us on social media\n\nFor any comments, thoughts, suggestions, or complaints concerning any of our content or any other matter, you can contact us on:\n\nEmail: feedback@faithtv.co.ke\n\n\n\"So then faith comes by hearing, and hearing by the word of God\" - Romans 10:17",
    "status": "Offline",
    "views": "2,291 views"
  },
  {
    "id": 98,
    "name": "KJD TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/99_icon_IMG-20220926-WA0005.jpg",
    "description": "KDJ TV channel is about our lives,  \nwe will focus on..\n-live event\n-news\n-sport (live)\n-Talk show \nAnd more like ukulima[shamba]\n-series",
    "status": "Online",
    "views": "834 views"
  },
  {
    "id": 99,
    "name": "Parliament Of Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/100_icon_download (2).jpeg",
    "description": "Parliament Of Kenya This is the official Parliament of Kenya YouTube channel for all official videos produced by Parliament.",
    "status": "Offline",
    "views": "1,853 views"
  },
  {
    "id": 100,
    "name": "My Connect TV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/101_icon_1664842400356.jpg",
    "description": "My Connect TV Kenya",
    "status": "Online",
    "views": "986 views"
  },
  {
    "id": 101,
    "name": "Destiny Voices TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/102_icon_images.png",
    "description": "INFORMATION HOUSE 2ND FLOOR S8 OPPOSITE UKWALA SUPER MARKET, OFF MFANGANO STREET",
    "status": "Offline",
    "views": "1,294 views"
  },
  {
    "id": 102,
    "name": "Sasa TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/103_icon_images.jpeg",
    "description": "SASA TV GOSPEL is a Gospel Tv Channel associated with SASA Television station, which airs preaching and teachings of the man of God Apostle James Maina Ng'ang'a. Watch Sasa TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "3,088 views"
  },
  {
    "id": 103,
    "name": "Getembe TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/104_icon_getembe-icon.jpg",
    "description": "Getembe TV Kenya is a commercial Kisii TV Station according to IPSOS Q3 SURVEY OF 2021. We also boast of the First Visual Radio: 102.7 Getembe FM which is taking the region by storm. We have the greatest Online Presence among all Kisii-based Media Houses.",
    "status": "Online",
    "views": "2,917 views"
  },
  {
    "id": 104,
    "name": "Kamba TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/105_icon_kambatv-profile.jpg",
    "description": "Kamba TV is among the leading 24-hour indigenous broadcaster in Kenya, with a bulk of our programs aired in the Kikamba Dialect of Kenya.Kamba TV is a brand name under HomeMedia Communications Ltd.We are a Free-to-air channel, with coverage across over 10 counties including: Nairobi, Mombasa, Machakos, Kitui, Makueni, Embu, Muranga, Kiambu, Nakuru, Kisii, Kajiado, Narok, Kirinyaga & Taita Taveta. We have round-the-clock Programming, steered by a team of competent anchors & hosts.Educating, informing, and entertaining the populace daily, in the dynamic and competitive media and communications world",
    "status": "Online",
    "views": "1,791 views"
  },
  {
    "id": 105,
    "name": "Nyumbaiitu TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/106_icon_nyumba-icon.jpg",
    "description": "Nyumbaiitu TV MOHORO MA NYUMBA IITU THAA IIMWE CIA HWAINI\n\nNyumba iitu TV is a Kenyan Vernacular free-to-air television channel that broadcast mainly in Kikuyu and Kiswahili. It was founded in 2020. We air a variety of entertainment genres, ranging from Local to international content.",
    "status": "Online",
    "views": "2,622 views"
  },
  {
    "id": 106,
    "name": "Muthingi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/107_icon_download.png",
    "description": "Muthingi TV Kenya's next big Kikuyu TV station KIHUMO GIA GUTHEREMA\nFOR DISCUSSIONS ON CURRENT AFFAIRS GOSPEL MUSIC,COUNSELING AND PREACHING",
    "status": "Offline",
    "views": "1,811 views"
  },
  {
    "id": 107,
    "name": "Favour Of God TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/108_icon_FOGTV-Profile.jpg",
    "description": "Welcome to Favour of God TV. We are located at Baraka estate (mosquito estate), Kitui Town. We hope that this space will be a space to experience the mercy of God. This is so that we can be saved, healed, delivered and restored.",
    "status": "Offline",
    "views": "825 views"
  },
  {
    "id": 108,
    "name": "Tandao TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/108_icon_tandaotv.jpg",
    "description": "Tandao TV is your News, Entertainment, Politics, Sports, Health, website. We provide you with the latest breaking news and videos straight from Kenya and the World. Watch Tandao TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "9,483 views"
  },
  {
    "id": 109,
    "name": "Weru TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/109_icon_wertv-icon.jpg",
    "description": "Weru TV is Kenya's Vernacular television station commanding a wide audience reach In Meru County,Tharaka Nithi County ,Embu County ,Laikipia County,Isiolo County and Their Environs.\n\nThis is your ideal tv channel for the latest and breaking news, top stories, politics, business, sports, lifestyle and entertainment from Kenya and around the world.",
    "status": "Offline",
    "views": "6,171 views"
  },
  {
    "id": 110,
    "name": "Ukombozi TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/110_icon_ukombozitv.png",
    "description": "Ukombozi tv kenya Kituo cha ukombozi na Uzima. Asante kwa kutazama runinga ya Ukombozi TV. Ukitaka kupokea uponyaji, unabii na ukombozi, usisite kuongea naye mtumishi wa Mungu, Apostle Dr. Jonas The Great kupitia 0748306037. Pia waweza kutumia nambari hio kwa matoleo, fungu la kumi na pia kutuma usaidizi wako.",
    "status": "Offline",
    "views": "1,566 views"
  },
  {
    "id": 111,
    "name": "Elshaddai TV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/111_icon_elshaddaitv.png",
    "description": "Elshaddai TV Kenya is a gospel tv station based in Kenya.",
    "status": "Online",
    "views": "1,057 views"
  },
  {
    "id": 112,
    "name": "Weega TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/112_icon_1668177568125.jpg",
    "description": "Weega TV Kenya is a commercial based channel broadcasting political, religious and social economic content in Kikuyu language.",
    "status": "Online",
    "views": "2,589 views"
  },
  {
    "id": 113,
    "name": "Testimony TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/113_icon_testimonytv-icon.png",
    "description": "Testimony TV believe in one God — Father, Son, and Holy Spirit, Creator of all things. We believe that the Lord Jesus Christ, the first begotten Son of God, was conceived of the Holy Spirit, was born of the Virgin Mary, was crucified and died, was buried and resurrected, ascended into heaven, is now seated at the right hand of God the Father, and is both true God and true man.",
    "status": "Offline",
    "views": "1,040 views"
  },
  {
    "id": 114,
    "name": "Repower TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/114_icon_repowertv-icon.jpg",
    "description": "Repower TV Re-energizing Re-touching Re-powering ",
    "status": "Online",
    "views": "2,058 views"
  },
  {
    "id": 115,
    "name": "DGTV Live",
    "icon": "https://kenyalivetv.co.ke/channels/115_icon_dgtv-ico.jpeg",
    "description": "DGTV Kenya is offering content that enriches the Society, Spiritually, Economically and Socially.\nAvailable on Pang and Free-To Air \nDGTVKenya - Christian Television\nCHRISTIAN BROADCASTING CHANNEL. DOMINION GENERATION TELEVISION",
    "status": "Offline",
    "views": "1,050 views"
  },
  {
    "id": 116,
    "name": "Truth TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/116_icon_truth-tv-icon.png",
    "description": "Truth TV Kenya exist to tell the truth; locally, regionally and internationally for transformation of individuals, their community and society sustainably.\n\nWelcome to Truth TV channel committed to sharing God's grace through broadcast media. Our mission is to make the truth of the cross be known John 8:32",
    "status": "Offline",
    "views": "1,190 views"
  },
  {
    "id": 117,
    "name": "Helicopter TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/117_icon_helitv-icon.jpg",
    "description": "WELCOME TO HELICOPTER TV KENYA . PLEASE FOLLOW US FOR MORE LIFE CHANGING VIDEOS LIKE THIS. WE ARE IN LANGATA ROADD,CANIVORE STAGE ,OPPOSITE RUBIS BEHIND FREEDOM HEIGHTS, KENYA, . HERE, ALL THINGS ARE POSSIBLE. COME ONE, COME ALL!",
    "status": "Offline",
    "views": "1,244 views"
  },
  {
    "id": 118,
    "name": "Massa TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/118_icon_massatv-icon.jpg",
    "description": "Massa TV Kenya's number 1 TV Station. Breaking News / Entertainment / Your Favourite Local TV Shows.",
    "status": "Online",
    "views": "2,263 views"
  },
  {
    "id": 119,
    "name": "Githima TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/119_icon_githimatv-ico.png",
    "description": "Githima TV Kenya is a television channel that can be accessed on Startimes channel number 490 and is also free to air. The station is owned by Bishop JJ Gitahi of the Priesthood Fellowship Church, Kahawa West.\n\nThe channel can be accessed on Pang Channel 490. Githima TV is also free to air channel. It broadcasts a wide range of quality programs ranging from sports to politics and news and updates. Some of the programs you can watch on the channel include:\n\nMugithi Live\nMohoro Utuku\nMohoro Hwaini\nKwigarika\nGukinyukia Ki Roho\nGithima Gugithera\nKirima-Ini o Ruciini\nMenya Watho\nHinya wa Macegera",
    "status": "Offline",
    "views": "2,941 views"
  },
  {
    "id": 120,
    "name": "Jiam JBN TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/120_icon_jiam-jbn-icon.jpeg",
    "description": "JIAM-JBN TV Kenya Bishop Margaret Wanjiru Invites you to Jesus Is Alive Ministries located along Haile Selassie Avenue. Welcome your family and friends to come and worship with us. ",
    "status": "Online",
    "views": "722 views"
  },
  {
    "id": 121,
    "name": "Ndurumeni TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/121_icon_ndurutv-poster.jpg",
    "description": "Ndurumeni TV Kenya CECENI IRIA IRIMEMEREKAGIRIO NA RUTHIOMI RWA GIKUYU",
    "status": "Offline",
    "views": "4,923 views"
  },
  {
    "id": 122,
    "name": "Goshen Wonders TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/122_icon_Goshentv.jpg",
    "description": "Welcome to Goshen Wonders Television Channel. Our mandate is to Break Destiny Limits.\n\n\nWonders Tabernacle Church is a ministry with the mandate to liberate people to manifest their destinies.\n\nOur vision is Heaven on Earth and Heaven at Last. \n\nOur Headquarters are situated in Ruiru, Kenya off Thika superhighway opposite Plainsview Hospital, near Kihunguro stage.",
    "status": "Offline",
    "views": "745 views"
  },
  {
    "id": 123,
    "name": "Deliverance TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/123_icon_deliverancetv-icon.jpg",
    "description": "Deliverance TV Kenya We are  a Christian Television In Kenya Spreading the Good News of the Lord.",
    "status": "Online",
    "views": "749 views"
  },
  {
    "id": 124,
    "name": "Urejesho TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/124_icon_urejeshotv.jpg",
    "description": "Urejesho TV Africa Live",
    "status": "Offline",
    "views": "870 views"
  },
  {
    "id": 125,
    "name": "GTN TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/127_icon_1675112627938.jpg",
    "description": "GTN TV Kenya is local TV station situated at Othaya. We are focused on creating platform for local content and give upcoming artists a chance to showcase their prowess in the world art.",
    "status": "Offline",
    "views": "2,315 views"
  },
  {
    "id": 126,
    "name": "Goodwill TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/128_icon_goodwilltv.jpg",
    "description": "Goodwill TV is a Christian television network that offers programming that is focused on promoting positive values, faith, and hope. The channel aims to provide a platform for spreading the message of Jesus Christ and inspiring viewers to lead a life of purpose and meaning. The programming on Goodwill TV typically includes sermons, teachings, and discussions on religious topics, as well as worship music, prayers, and interviews with spiritual leaders and experts. The network is designed to be a source of comfort, inspiration, and guidance for individuals seeking a closer relationship with God.",
    "status": "Online",
    "views": "3,149 views"
  },
  {
    "id": 127,
    "name": "Zoe TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/129_icon_zoetv.jpg",
    "description": "Zoe TV Kenya is a licensed free to air Christian Television station in Nairobi, Kenya that seeks to impact the youth through media.",
    "status": "Offline",
    "views": "1,029 views"
  },
  {
    "id": 128,
    "name": "West TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/130_icon_westtv.jpg",
    "description": "West TV Is a regional Tv station in Western Kenya. watch us on startimes 118, Gotv 805 and Bamba Tv 807. sms 21905",
    "status": "Online",
    "views": "2,444 views"
  },
  {
    "id": 129,
    "name": "Cocomelon Songs Live",
    "icon": "https://kenyalivetv.co.ke/channels/131_icon_cocomelon.jpg",
    "description": "Cocomelon has always been to engage families with entertaining and educational content that makes universally-relatable preschool moments fun. ",
    "status": "Offline",
    "views": "3,348 views"
  },
  {
    "id": 130,
    "name": "Aviation TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/132_icon_aviationtv.jpg",
    "description": "Aviation TV Kenya is a Christian television station based in Nairobi, Kenya, that focuses on providing quality programming for its viewers. The station's programming primarily focuses on aviation, travel, and Christian values, making it a unique and niche broadcaster within the Kenyan media landscape.",
    "status": "Offline",
    "views": "1,618 views"
  },
  {
    "id": 131,
    "name": "Oracle TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/133_icon_oraclestv.jpg",
    "description": "Oracle TV Kenya is a tv channel that offers a diverse range of programming, including news, current affairs, entertainment, sports, and lifestyle content. It aims to provide viewers with accurate and reliable information, while also entertaining and engaging them with quality programming. Oracle TV is available on a variety of platforms, including satellite, cable\n\nOracle Television Network Kenya is a commercial licensed Christian Television station headquartered  in Nakuru KENYA  airing NATIONWIDE on the SIGNET platform. It offers programs on holistic Biblical teachings, societal or community based shows, lifestyle and business programs for children, youths, men, women and the entire family.",
    "status": "Offline",
    "views": "1,389 views"
  },
  {
    "id": 132,
    "name": "Ithaga TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/134_icon_ithagatv.jpg",
    "description": "Ithaga TV is a Kenyan television channel that primarily broadcasts news, current affairs, and cultural programming in the Kikuyu language. It aims to provide informative and engaging content for viewers interested in Kenyan and global news, politics, business, sports, and entertainment. The channel is available on various platforms, including digital terrestrial television and online streaming.",
    "status": "Online",
    "views": "1,105 views"
  },
  {
    "id": 133,
    "name": "Mountain Of Fire TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/137_icon_moftv.png",
    "description": "Mountain of Fire TV Kenya is a Christian television channel that aims to spread the Gospel of Jesus Christ to viewers in Kenya and beyond. The channel features a variety of programs such as sermons, worship services, testimonies, and other Christian content that is intended to edify and encourage its audience. \n\nMountain of Fire TV Kenya is affiliated with the Mountain of Fire and Miracles Ministries, a Pentecostal Christian organization with a global presence.",
    "status": "Online",
    "views": "864 views"
  },
  {
    "id": 134,
    "name": "AfroSports TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/138_icon_AfroSports.jpg",
    "description": "Afro Sports TV is a digital media platform that focuses on covering sports news, analysis, and highlights with a particular emphasis on African athletes, teams, and events. It aims to provide comprehensive coverage of various sports disciplines and promote African sports culture globally through engaging content, interviews, and documentaries.",
    "status": "Online",
    "views": "2,257 views"
  },
  {
    "id": 135,
    "name": "JCC TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/139_icon_jcctv.jpg",
    "description": "JCC TV ( Jubilee Christian church ) is a charismatic, non-denominational church founded on the Rock Jesus which was launched on 17th January 1999 by the visionaries Bishop Allan Kiuna and his wife Reverend Kathy Kiuna in obedience to God’s instruction and direction.",
    "status": "Offline",
    "views": "751 views"
  },
  {
    "id": 136,
    "name": "JCM TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/140_icon_jcmtv.jpg",
    "description": "JCM TV is a Christian television network dedicated to broadcasting content that aligns with the principles and teachings of the Christian faith. It offers a variety of programs aimed at inspiring, educating, and uplifting viewers through the message of the Gospel.",
    "status": "Offline",
    "views": "4,071 views"
  },
  {
    "id": 137,
    "name": "Doxa TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/141_icon_doxatv.jpg",
    "description": "DOXA TV Kenya is located in Kitengela, under Deliverance Church International Kitengela.\nOur mission is 'Reaching the world with the gospel of Jesus Christ'\nWe broadcast locally produced content and internal content, all with the aim of teaching and equipping our viewers with the word of God.\nOur programs include; Sermons, Family Talk Shows, Youth Empowerment and Gospel Music.",
    "status": "Offline",
    "views": "834 views"
  },
  {
    "id": 138,
    "name": "TV West Live",
    "icon": "https://kenyalivetv.co.ke/channels/142_icon_tvwest.jpg",
    "description": "TV West is a television channel owned by VisionGroup.Uganda's leading media House. Based in Mbarara, we broadcast in Runyakitara (Runyankore, Rukiga, Runyoro,Rutooro). Watch TV West Live online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "1,016 views"
  },
  {
    "id": 139,
    "name": "Alhuda TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/143_icon_alhudatv.jpg",
    "description": "Alhuda TV Kenya, also known as Islam TV, is a religious television channel based in Kenya that focuses on promoting and broadcasting Islamic teachings, values, and culture. The channel aims to provide informative, educational, and inspirational content for Muslims and non-Muslims alike, fostering understanding and promoting harmony in society.",
    "status": "Online",
    "views": "257 views"
  },
  {
    "id": 140,
    "name": "Mizpah TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/144_icon_mizpahtv.jpg",
    "description": "Mizpah TV Kenya is a 24-hour channel of keeping the fire of the altar burning through worship, word, and prayer; with much more on educational, motivational, inspirational, informative, and entertaining programs.",
    "status": "Online",
    "views": "261 views"
  },
  {
    "id": 141,
    "name": "Winner TV Kenya Live",
    "icon": "https://kenyalivetv.co.ke/channels/145_icon_winnertv.jpg",
    "description": "Winner TV Kenya is a prominent Christian television network that offers a diverse range of programming to its viewers. With a focus on faith-based content, the channel provides inspiring Christian messages, engaging movies with moral values, up-to-date news from a biblical perspective, and light-hearted comedy for entertainment.",
    "status": "Online",
    "views": "544 views"
  },
  {
    "id": 142,
    "name": "Salt TV Uganda Live",
    "icon": "https://kenyalivetv.co.ke/channels/146_icon_salttvug.jpg",
    "description": "Salt TV Uganda is Christian based television station with programming that cuts across to fit all audiences. Watch Salt TV Uganda online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "302 views"
  },
  {
    "id": 143,
    "name": "TV East Uganda Live",
    "icon": "https://kenyalivetv.co.ke/channels/147_icon_tveast.png",
    "description": "Tv East Uganda is part of Vision Group and broadcasts in the Eastern Ugandan Languages. Watch TV East online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "605 views"
  },
  {
    "id": 144,
    "name": "Urban TV Uganda Live",
    "icon": "https://kenyalivetv.co.ke/channels/148_icon_urbantv.jpg",
    "description": "Urban TV Uganda is your source of information, news, entertainment, and sports. Go behind the scenes to see all the faces and places that keep Urban Television fresh, fun & informed. Watch Urban TV online on kenyalivetv.co.ke",
    "status": "Offline",
    "views": "665 views"
  },
  {
    "id": 145,
    "name": "Wavetime TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/149_icon_wavetimetv.png",
    "description": "Wavetime TV Kenya endeavors to be a beacon of light, fostering unity and spiritual growth among viewers from diverse backgrounds, irrespective of age or denomination.",
    "status": "Online",
    "views": "251 views"
  },
  {
    "id": 146,
    "name": "Mashariki TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/150_icon_masharikitv.jpg",
    "description": "Mashariki TV Kenya is a popular television station located in Meru, Kenya. It offers a diverse range of general entertainment programs to its viewers. With a variety of shows, including drama, comedy, reality TV, and lifestyle content, Mashariki TV aims to cater to the entertainment preferences of a wide audience. ",
    "status": "Offline",
    "views": "573 views"
  },
  {
    "id": 147,
    "name": "Mamlaka TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/151_icon_mamlakatv.jpg",
    "description": "Mamlaka TV is a Christian based Television network based in Nakuru Kenya, founded by Chosen Generation Church Nakuru . MAMLAKA TV Covers Nakuru, Nyandarua & Laikipia counties and their environments, broadcasting on Pang number 146. The TV station’s core mandate is to “Impact Generations” with practical life solutions from Biblical principles. MAMLAKA TV does this by running different shows that touch on different areas of human life intending to bring people back to God and we believe that we can help share the goals and visions of your production through our network.",
    "status": "Offline",
    "views": "931 views"
  },
  {
    "id": 148,
    "name": "Baite TV Live",
    "icon": "https://kenyalivetv.co.ke/channels/152_icon_baitetv.jpg",
    "description": "Baite TV New Station is born. Baite Tv is Kenya's first Meru/KISWAHILI language Digital channel.",
    "status": "Online",
    "views": "77 views"
  }
]